In [42]:
import pandas as pd

In [43]:
#宣告空的dataframe
#把欲新增的欄位加入倒column裡
df = pd.DataFrame(columns=['Name','Age','Height'])  
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [44]:
#把資料塞進去，內容順序要跟欄位一樣
df.loc[0] = ['AMY','22','175']
df.loc[1] = ['ELLA','18','155']
df.loc[2] = ['JAY','20','164']

In [45]:
df

   Name Age Height
0   AMY  22    175
1  ELLA  18    155
2   JAY  20    164

In [46]:
#加入一個新的欄位
df['Weight'] = ['75','80','55']

In [47]:
df

   Name Age Height Weight
0   AMY  22    175     75
1  ELLA  18    155     80
2   JAY  20    164     55

In [48]:
#刪除欄位(drop只是先看一下欄位刪掉長什麼樣子，不是真的刪掉
df.drop(['Weight'],axis=1)

   Name Age Height
0   AMY  22    175
1  ELLA  18    155
2   JAY  20    164

In [49]:
df

   Name Age Height Weight
0   AMY  22    175     75
1  ELLA  18    155     80
2   JAY  20    164     55

In [50]:
#如果要真的刪掉欄位，要在宣告一次
df = df.drop(['Weight'],axis=1)

In [34]:
df

   Name Age Height
0   AMY  22    175
1  ELLA  18    155
2   JAY  20    164

In [51]:
#刪除一個ROW 
df = df.drop(2)

In [52]:
df

   Name Age Height
0   AMY  22    175
1  ELLA  18    155

In [53]:
df['Age'][0]

'22'

In [54]:
df['Age'][0] ='23'

In [55]:
df

   Name Age Height
0   AMY  23    175
1  ELLA  18    155

In [56]:

df.loc[0]

Name      AMY
Age        23
Height    175
Name: 0, dtype: object

In [57]:
df.loc[0] = 'aaaa'

In [58]:
df

   Name   Age Height
0  aaaa  aaaa   aaaa
1  ELLA    18    155

In [59]:
df.to_csv('./test.csv')#存檔

In [60]:
df.to_csv('./test.csv' , index = 0) #存檔，沒存最前面的序號

In [61]:
df2 = pd.read_csv('./test.csv') #讀檔

In [62]:
df2

   Name   Age Height
0  aaaa  aaaa   aaaa
1  ELLA    18    155

In [64]:
#一次做好表格，先宣告欄位名稱跟內部資料再放入pd.datadframe中
columns = ['Name','Age','Height']
data = [ 
['Allen','22','175'],
['Ted','25','180']
]

df3 = pd.DataFrame(data=data,columns=columns)
df3

    Name Age Height
0  Allen  22    175
1    Ted  25    180